MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamr30/thirdparty/atsamr30/component/tcc.h
/* DITH5 mode */
#define TCC_CC_DITH5_DITHER_Pos               _U_(0)                                               /**< (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH5_DITHER_Msk               (_U_(0x1F) << TCC_CC_DITH5_DITHER_Pos)               /**< (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH5_DITHER(value)            (TCC_CC_DITH5_DITHER_Msk & ((value) << TCC_CC_DITH5_DITHER_Pos))
#define TCC_CC_DITH5_CC_Pos                   _U_(5)                                               /**< (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH5_CC_Msk                   (_U_(0x7FFFF) << TCC_CC_DITH5_CC_Pos)                /**< (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH5_CC(value)                (TCC_CC_DITH5_CC_Msk & ((value) << TCC_CC_DITH5_CC_Pos))
#define TCC_CC_DITH5_Msk                      _U_(0x00FFFFFF)                                       /**< (TCC_CC_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_CC_DITH6_DITHER_Pos               _U_(0)                                               /**< (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH6_DITHER_Msk               (_U_(0x3F) << TCC_CC_DITH6_DITHER_Pos)               /**< (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH6_DITHER(value)            (TCC_CC_DITH6_DITHER_Msk & ((value) << TCC_CC_DITH6_DITHER_Pos))
#define TCC_CC_DITH6_CC_Pos                   _U_(6)                                               /**< (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH6_CC_Msk                   (_U_(0x3FFFF) << TCC_CC_DITH6_CC_Pos)                /**< (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_DITH6_CC(value)                (TCC_CC_DITH6_CC_Msk & ((value) << TCC_CC_DITH6_CC_Pos))
#define TCC_CC_DITH6_Msk                      _U_(0x00FFFFFF)                                       /**< (TCC_CC_DITH6) Register Mask  */


/* -------- TCC_PATTBUF : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#define TCC_PATTBUF_RESETVALUE                _U_(0x00)                                            /**<  (TCC_PATTBUF) Pattern Buffer  Reset Value */

#define TCC_PATTBUF_PGEB0_Pos                 _U_(0)                                               /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB0_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB0_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB0(value)              (TCC_PATTBUF_PGEB0_Msk & ((value) << TCC_PATTBUF_PGEB0_Pos))
#define TCC_PATTBUF_PGEB1_Pos                 _U_(1)                                               /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB1_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB1_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB1(value)              (TCC_PATTBUF_PGEB1_Msk & ((value) << TCC_PATTBUF_PGEB1_Pos))
#define TCC_PATTBUF_PGEB2_Pos                 _U_(2)                                               /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB2_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB2_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB2(value)              (TCC_PATTBUF_PGEB2_Msk & ((value) << TCC_PATTBUF_PGEB2_Pos))
#define TCC_PATTBUF_PGEB3_Pos                 _U_(3)                                               /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB3_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB3_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB3(value)              (TCC_PATTBUF_PGEB3_Msk & ((value) << TCC_PATTBUF_PGEB3_Pos))
#define TCC_PATTBUF_PGEB4_Pos                 _U_(4)                                               /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB4_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB4_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB4(value)              (TCC_PATTBUF_PGEB4_Msk & ((value) << TCC_PATTBUF_PGEB4_Pos))
#define TCC_PATTBUF_PGEB5_Pos                 _U_(5)                                               /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB5_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB5_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB5(value)              (TCC_PATTBUF_PGEB5_Msk & ((value) << TCC_PATTBUF_PGEB5_Pos))
#define TCC_PATTBUF_PGEB6_Pos                 _U_(6)                                               /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB6_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB6_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB6(value)              (TCC_PATTBUF_PGEB6_Msk & ((value) << TCC_PATTBUF_PGEB6_Pos))
#define TCC_PATTBUF_PGEB7_Pos                 _U_(7)                                               /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer Position */
#define TCC_PATTBUF_PGEB7_Msk                 (_U_(0x1) << TCC_PATTBUF_PGEB7_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Buffer Mask */
#define TCC_PATTBUF_PGEB7(value)              (TCC_PATTBUF_PGEB7_Msk & ((value) << TCC_PATTBUF_PGEB7_Pos))
#define TCC_PATTBUF_PGVB0_Pos                 _U_(8)                                               /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Position */
#define TCC_PATTBUF_PGVB0_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB0_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 0 Output Enable Mask */
#define TCC_PATTBUF_PGVB0(value)              (TCC_PATTBUF_PGVB0_Msk & ((value) << TCC_PATTBUF_PGVB0_Pos))
#define TCC_PATTBUF_PGVB1_Pos                 _U_(9)                                               /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Position */
#define TCC_PATTBUF_PGVB1_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB1_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 1 Output Enable Mask */
#define TCC_PATTBUF_PGVB1(value)              (TCC_PATTBUF_PGVB1_Msk & ((value) << TCC_PATTBUF_PGVB1_Pos))
#define TCC_PATTBUF_PGVB2_Pos                 _U_(10)                                              /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Position */
#define TCC_PATTBUF_PGVB2_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB2_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 2 Output Enable Mask */
#define TCC_PATTBUF_PGVB2(value)              (TCC_PATTBUF_PGVB2_Msk & ((value) << TCC_PATTBUF_PGVB2_Pos))
#define TCC_PATTBUF_PGVB3_Pos                 _U_(11)                                              /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Position */
#define TCC_PATTBUF_PGVB3_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB3_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 3 Output Enable Mask */
#define TCC_PATTBUF_PGVB3(value)              (TCC_PATTBUF_PGVB3_Msk & ((value) << TCC_PATTBUF_PGVB3_Pos))
#define TCC_PATTBUF_PGVB4_Pos                 _U_(12)                                              /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Position */
#define TCC_PATTBUF_PGVB4_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB4_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 4 Output Enable Mask */
#define TCC_PATTBUF_PGVB4(value)              (TCC_PATTBUF_PGVB4_Msk & ((value) << TCC_PATTBUF_PGVB4_Pos))
#define TCC_PATTBUF_PGVB5_Pos                 _U_(13)                                              /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Position */
#define TCC_PATTBUF_PGVB5_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB5_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 5 Output Enable Mask */
#define TCC_PATTBUF_PGVB5(value)              (TCC_PATTBUF_PGVB5_Msk & ((value) << TCC_PATTBUF_PGVB5_Pos))
#define TCC_PATTBUF_PGVB6_Pos                 _U_(14)                                              /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Position */
#define TCC_PATTBUF_PGVB6_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB6_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 6 Output Enable Mask */
#define TCC_PATTBUF_PGVB6(value)              (TCC_PATTBUF_PGVB6_Msk & ((value) << TCC_PATTBUF_PGVB6_Pos))
#define TCC_PATTBUF_PGVB7_Pos                 _U_(15)                                              /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Position */
#define TCC_PATTBUF_PGVB7_Msk                 (_U_(0x1) << TCC_PATTBUF_PGVB7_Pos)                  /**< (TCC_PATTBUF) Pattern Generator 7 Output Enable Mask */
#define TCC_PATTBUF_PGVB7(value)              (TCC_PATTBUF_PGVB7_Msk & ((value) << TCC_PATTBUF_PGVB7_Pos))
#define TCC_PATTBUF_Msk                       _U_(0xFFFF)                                          /**< (TCC_PATTBUF) Register Mask  */

#define TCC_PATTBUF_PGEB_Pos                  _U_(0)                                               /**< (TCC_PATTBUF Position) Pattern Generator x Output Enable Buffer */
#define TCC_PATTBUF_PGEB_Msk                  (_U_(0xFF) << TCC_PATTBUF_PGEB_Pos)                  /**< (TCC_PATTBUF Mask) PGEB */
#define TCC_PATTBUF_PGEB(value)               (TCC_PATTBUF_PGEB_Msk & ((value) << TCC_PATTBUF_PGEB_Pos)) 
#define TCC_PATTBUF_PGVB_Pos                  _U_(8)                                               /**< (TCC_PATTBUF Position) Pattern Generator 7 Output Enable */
#define TCC_PATTBUF_PGVB_Msk                  (_U_(0xFF) << TCC_PATTBUF_PGVB_Pos)                  /**< (TCC_PATTBUF Mask) PGVB */
#define TCC_PATTBUF_PGVB(value)               (TCC_PATTBUF_PGVB_Msk & ((value) << TCC_PATTBUF_PGVB_Pos)) 

/* -------- TCC_PERBUF : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#define TCC_PERBUF_RESETVALUE                 _U_(0xFFFFFFFF)                                      /**<  (TCC_PERBUF) Period Buffer  Reset Value */

#define TCC_PERBUF_PERBUF_Pos                 _U_(0)                                               /**< (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_PERBUF_Msk                 (_U_(0xFFFFFF) << TCC_PERBUF_PERBUF_Pos)             /**< (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_PERBUF(value)              (TCC_PERBUF_PERBUF_Msk & ((value) << TCC_PERBUF_PERBUF_Pos))
#define TCC_PERBUF_Msk                        _U_(0x00FFFFFF)                                      /**< (TCC_PERBUF) Register Mask  */

/* DITH4 mode */
#define TCC_PERBUF_DITH4_DITHERBUF_Pos        _U_(0)                                               /**< (TCC_PERBUF) Dithering Buffer Cycle Number Position */
#define TCC_PERBUF_DITH4_DITHERBUF_Msk        (_U_(0xF) << TCC_PERBUF_DITH4_DITHERBUF_Pos)         /**< (TCC_PERBUF) Dithering Buffer Cycle Number Mask */
#define TCC_PERBUF_DITH4_DITHERBUF(value)     (TCC_PERBUF_DITH4_DITHERBUF_Msk & ((value) << TCC_PERBUF_DITH4_DITHERBUF_Pos))
#define TCC_PERBUF_DITH4_PERBUF_Pos           _U_(4)                                               /**< (TCC_PERBUF) Period Buffer Value Position */
#define TCC_PERBUF_DITH4_PERBUF_Msk           (_U_(0xFFFFF) << TCC_PERBUF_DITH4_PERBUF_Pos)        /**< (TCC_PERBUF) Period Buffer Value Mask */
#define TCC_PERBUF_DITH4_PERBUF(value)        (TCC_PERBUF_DITH4_PERBUF_Msk & ((value) << TCC_PERBUF_DITH4_PERBUF_Pos))
#define TCC_PERBUF_DITH4_Msk                  _U_(0x00FFFFFF)                                       /**< (TCC_PERBUF_DITH4) Register Mask  */

